In [1]:
import pandas as pd
import numpy as np

In [150]:
inspections = pd.read_csv("datasets/chicago_food_inspections.csv")

inspections.head()

                          Name             Risk
0   MARRIOT MARQUIS CHICAGO       Risk 1 (High)
1                  JETS PIZZA   Risk 2 (Medium)
2                   ROOM 1520      Risk 3 (Low)
3    MARRIOT MARQUIS CHICAGO      Risk 1 (High)
4                CHARTWELLS       Risk 1 (High)

In [151]:
inspections.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153810 entries, 0 to 153809
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Name    153810 non-null  object
 1   Risk    153744 non-null  object
dtypes: object(2)
memory usage: 2.3+ MB

In [152]:
inspections.head()

                          Name             Risk
0   MARRIOT MARQUIS CHICAGO       Risk 1 (High)
1                  JETS PIZZA   Risk 2 (Medium)
2                   ROOM 1520      Risk 3 (Low)
3    MARRIOT MARQUIS CHICAGO      Risk 1 (High)
4                CHARTWELLS       Risk 1 (High)

In [153]:
inspections["Name"].head().values

array([' MARRIOT MARQUIS CHICAGO   ', ' JETS PIZZA ', '   ROOM 1520 ',
       '  MARRIOT MARQUIS CHICAGO  ', ' CHARTWELLS   '], dtype=object)

In [154]:
inspections.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153810 entries, 0 to 153809
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Name    153810 non-null  object
 1   Risk    153744 non-null  object
dtypes: object(2)
memory usage: 2.3+ MB

In [155]:
inspections["Name"].head()

0     MARRIOT MARQUIS CHICAGO
1                    JETS PIZZA
2                     ROOM 1520
3      MARRIOT MARQUIS CHICAGO
4                  CHARTWELLS
Name: Name, dtype: object

In [156]:
inspections["Name"].str

In [157]:
inspections["Name"].str.lstrip().head().values

array(['MARRIOT MARQUIS CHICAGO   ', 'JETS PIZZA ', 'ROOM 1520 ',
       'MARRIOT MARQUIS CHICAGO  ', 'CHARTWELLS   '], dtype=object)

In [158]:
inspections["Name"].str.rstrip().head().values

array([' MARRIOT MARQUIS CHICAGO', ' JETS PIZZA', '   ROOM 1520',
       '  MARRIOT MARQUIS CHICAGO', ' CHARTWELLS'], dtype=object)

In [159]:
inspections["Name"].str.strip().head().values

array(['MARRIOT MARQUIS CHICAGO', 'JETS PIZZA', 'ROOM 1520',
       'MARRIOT MARQUIS CHICAGO', 'CHARTWELLS'], dtype=object)

In [160]:
def wrangle_whitespace(df_obj):
    for column in df_obj.columns:
        df_obj[column] = df_obj[column].str.strip()

wrangle_whitespace(inspections)

In [161]:
inspections["Name"].str.strip().head().values

array(['MARRIOT MARQUIS CHICAGO', 'JETS PIZZA', 'ROOM 1520',
       'MARRIOT MARQUIS CHICAGO', 'CHARTWELLS'], dtype=object)

In [162]:
inspections.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153810 entries, 0 to 153809
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Name    153810 non-null  object
 1   Risk    153744 non-null  object
dtypes: object(2)
memory usage: 2.3+ MB

In [163]:
inspections["Name"].head()

0    MARRIOT MARQUIS CHICAGO
1                 JETS PIZZA
2                  ROOM 1520
3    MARRIOT MARQUIS CHICAGO
4                 CHARTWELLS
Name: Name, dtype: object

In [164]:
inspections["Name"].str.lower().head()

0    marriot marquis chicago
1                 jets pizza
2                  room 1520
3    marriot marquis chicago
4                 chartwells
Name: Name, dtype: object

In [165]:
inspections.head()

                      Name             Risk
0  MARRIOT MARQUIS CHICAGO    Risk 1 (High)
1               JETS PIZZA  Risk 2 (Medium)
2                ROOM 1520     Risk 3 (Low)
3  MARRIOT MARQUIS CHICAGO    Risk 1 (High)
4               CHARTWELLS    Risk 1 (High)

In [166]:
inspections["Name"] = inspections["Name"].str.title()

In [167]:
inspections.head()

                      Name             Risk
0  Marriot Marquis Chicago    Risk 1 (High)
1               Jets Pizza  Risk 2 (Medium)
2                Room 1520     Risk 3 (Low)
3  Marriot Marquis Chicago    Risk 1 (High)
4               Chartwells    Risk 1 (High)

In [168]:
inspections["Risk"] = inspections["Risk"].replace(
    to_replace="All", 
    value="Risk 4 (Extreme)",
)

In [170]:
inspections["Risk"].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)',
       'Risk 4 (Extreme)', nan], dtype=object)

In [171]:
inspections["Risk"] = inspections["Risk"].astype(dtype="category")

In [172]:
inspections.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153810 entries, 0 to 153809
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Name    153810 non-null  object
 1   Risk    153744 non-null  category
dtypes: category(1), object(1)
memory usage: 1.3+ MB

In [173]:
len(inspections)

153810

In [176]:
inspections = inspections.dropna(subset=["Risk"], how="any")

In [177]:
inspections.info()

<class 'pandas.core.frame.DataFrame'>
Index: 153744 entries, 0 to 153809
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Name    153744 non-null  object
 1   Risk    153744 non-null  category
dtypes: category(1), object(1)
memory usage: 2.5+ MB

In [178]:
inspections["Risk"].str.slice(5, 6).head()

0    1
1    2
2    3
3    1
4    1
Name: Risk, dtype: object

In [179]:
inspections["Risk"].str[5:6].head()

0    1
1    2
2    3
3    1
4    1
Name: Risk, dtype: object

In [180]:
inspections["Risk"].str.slice(8, -1).head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

In [181]:
inspections["Risk"].str[8:-1].head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

In [182]:
inspections["Risk"].str.slice(8).str.replace(')', '').head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

In [186]:
has_pizza = inspections["Name"].str.lower().str.contains("pizza")

has_pizza.head()

0    False
1     True
2    False
3    False
4    False
Name: Name, dtype: bool

In [188]:
inspections[has_pizza].head()

                             Name             Risk
1                      Jets Pizza  Risk 2 (Medium)
19  Nancy'S Home Of Stuffed Pizza    Risk 1 (High)
27     Nary'S Grill & Pizza ,Inc.    Risk 1 (High)
29            Narys Grill & Pizza    Risk 1 (High)
68                  Colutas Pizza    Risk 1 (High)

In [189]:
starts_with_tacos = inspections["Name"].str.lower().str.startswith("tacos")

# ends_with_tacos = inspections["Name"].str.lower().str.endswith("tacos")

starts_with_tacos.head()

0    False
1    False
2    False
3    False
4    False
Name: Name, dtype: bool

In [191]:
inspections[starts_with_tacos].head()

                     Name           Risk
69           Tacos Nietos  Risk 1 (High)
556   Tacos El Tio 2 Inc.  Risk 1 (High)
675      Tacos Don Gabino  Risk 1 (High)
958   Tacos El Tio 2 Inc.  Risk 1 (High)
1036  Tacos El Tio 2 Inc.  Risk 1 (High)

In [237]:
customers = pd.read_csv("datasets/customers.csv")

customers

                     Name                                            Address
0           Frank Manning  6461 Quinn Groves, East Matthew, New Hampshire...
1       Elizabeth Johnson  1360 Tracey Ports Apt. 419, Kyleport, Vermont,...
2         Donald Stephens  19120 Fleming Manors, Prestonstad, Montana, 23495
3     Michael Vincent III       441 Olivia Creek, Jimmymouth, Georgia, 82991
4          Jasmine Zamora  4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...
...                   ...                                                ...
9956        Dana Browning  762 Andrew Views Apt. 254, North Paul, New Mex...
9957      Amanda Anderson  44188 Day Crest Apt. 901, Lake Marcia, Maine, ...
9958           Eric Davis  73015 Michelle Squares, Watsonville, West Virg...
9959     Taylor Hernandez       129 Keith Greens, Haleyfurt, Oklahoma, 98916
9960     Sherry Nicholson   355 Griffin Valley, Davidtown, New Mexico, 17581

[9961 rows x 2 columns]

In [238]:
customers["Name"].head().values

array(['Frank Manning', 'Elizabeth Johnson', 'Donald Stephens',
       'Michael Vincent III', 'Jasmine Zamora'], dtype=object)

In [239]:
customers["Address"].head(10).values

array(['6461 Quinn Groves, East Matthew, New Hampshire, 16656',
       '1360 Tracey Ports Apt. 419, Kyleport, Vermont, 31924',
       '19120 Fleming Manors, Prestonstad, Montana, 23495',
       '441 Olivia Creek, Jimmymouth, Georgia, 82991',
       '4246 Chelsey Ford Apt. 310, Karamouth, Utah, 76252',
       '79736 Harris Plains, Lake Jennachester, Kentucky, 22299',
       '89808 Brown Plains, Fordhaven, Maryland, 16818',
       '778 James Common Suite 546, North Christine, Utah, 68320',
       '9566 Spencer Drive Apt. 219, New Alexandriamouth, Delaware, 56917',
       '6587 Victoria Wells, North Lisa, Georgia, 42954'], dtype=object)

In [240]:
customers["Name"].str.len().head()

0    13
1    17
2    15
3    19
4    14
Name: Name, dtype: int64

In [241]:
customers["Name"].str.split(pat=" ", n=1).head()

0          [Frank, Manning]
1      [Elizabeth, Johnson]
2        [Donald, Stephens]
3    [Michael, Vincent III]
4         [Jasmine, Zamora]
Name: Name, dtype: object

In [242]:
customers["Name"].str.split(pat=" ", n=1).str.len().head()

0    2
1    2
2    2
3    2
4    2
Name: Name, dtype: int64

In [243]:
customers["Name"].str.split(pat=" ", n=1).str.get(0).head()

0        Frank
1    Elizabeth
2       Donald
3      Michael
4      Jasmine
Name: Name, dtype: object

In [244]:
customers["Name"].str.split(pat=" ", n=1).str.get(1).head()  # str.get(-1)

0        Manning
1        Johnson
2       Stephens
3    Vincent III
4         Zamora
Name: Name, dtype: object

In [245]:
customers["Name"].str.split(pat=" ", n=1, expand=True).head()

           0            1
0      Frank      Manning
1  Elizabeth      Johnson
2     Donald     Stephens
3    Michael  Vincent III
4    Jasmine       Zamora

In [246]:
customers[["First Name", "Last Name"]] = customers["Name"].str.split(pat=" ", n=1, expand=True)

In [247]:
customers

,Name,Address,First Name,Last Name
0,Frank Manning,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning
1,Elizabeth Johnson,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson
2,Donald Stephens,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens
3,Michael Vincent III,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III
4,Jasmine Zamora,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora
...,...,...,...,...
9956,Dana Browning,"762 Andrew Views Apt. 254, North Paul, New Mex...",Dana,Browning
9957,Amanda Anderson,"44188 Day Crest Apt. 901, Lake Marcia, Maine, ...",Amanda,Anderson
9958,Eric Davis,"73015 Michelle Squares, Watsonville, West Virg...",Eric,Davis
9959,Taylor Hernandez,"129 Keith Greens, Haleyfurt, Oklahoma, 98916",Taylor,Hernandez
9960,Sherry Nicholson,"355 Griffin Valley, Davidtown, New Mexico, 17581",Sherry,Nicholson

In [248]:
customers = customers.drop(labels=["Name"], axis="columns")

In [249]:
customers

,Address,First Name,Last Name
0,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning
1,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson
2,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens
3,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III
4,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora
...,...,...,...
9956,"762 Andrew Views Apt. 254, North Paul, New Mex...",Dana,Browning
9957,"44188 Day Crest Apt. 901, Lake Marcia, Maine, ...",Amanda,Anderson
9958,"73015 Michelle Squares, Watsonville, West Virg...",Eric,Davis
9959,"129 Keith Greens, Haleyfurt, Oklahoma, 98916",Taylor,Hernandez
9960,"355 Griffin Valley, Davidtown, New Mexico, 17581",Sherry,Nicholson

In [250]:
customers[["Street", "City", "State", "Zip"]] = customers["Address"].str.split(pat=",", expand=True)

In [251]:
customers = customers.drop(labels=["Address"], axis="columns")

In [252]:
customers.head()

,First Name,Last Name,Street,City,State,Zip
0,Frank,Manning,6461 Quinn Groves,East Matthew,New Hampshire,16656
1,Elizabeth,Johnson,1360 Tracey Ports Apt. 419,Kyleport,Vermont,31924
2,Donald,Stephens,19120 Fleming Manors,Prestonstad,Montana,23495
3,Michael,Vincent III,441 Olivia Creek,Jimmymouth,Georgia,82991
4,Jasmine,Zamora,4246 Chelsey Ford Apt. 310,Karamouth,Utah,76252

In [255]:
customers.set_index(keys="First Name")

,Last Name,Street,City,State,Zip
First Name,,,,,
Frank,Manning,6461 Quinn Groves,East Matthew,New Hampshire,16656
Elizabeth,Johnson,1360 Tracey Ports Apt. 419,Kyleport,Vermont,31924
Donald,Stephens,19120 Fleming Manors,Prestonstad,Montana,23495
Michael,Vincent III,441 Olivia Creek,Jimmymouth,Georgia,82991
Jasmine,Zamora,4246 Chelsey Ford Apt. 310,Karamouth,Utah,76252
...,...,...,...,...,...
Dana,Browning,762 Andrew Views Apt. 254,North Paul,New Mexico,28889
Amanda,Anderson,44188 Day Crest Apt. 901,Lake Marcia,Maine,37378
Eric,Davis,73015 Michelle Squares,Watsonville,West Virginia,03933
Taylor,Hernandez,129 Keith Greens,Haleyfurt,Oklahoma,98916
Sherry,Nicholson,355 Griffin Valley,Davidtown,New Mexico,17581

In [258]:
customers.to_csv("datasets/new_customers.csv", index=False)